xhawk18/s_task/build_stm8s103/STM8S_StdPeriph_Lib/Libraries/STM8S_StdPeriph_Driver/src/stm8s_uart4.c
  temp = ((uint16_t)(((uint16_t)((uint16_t)UART4->CR1 & (uint16_t)UART4_CR1_R8)) << 1));
  
  return (uint16_t)((((uint16_t)UART4->DR) | temp) & ((uint16_t)0x01FF));
}

/**
  * @brief  Transmits 8 bit data through the UART4 peripheral.
  * @param  Data: the data to transmit.
  * @retval None
  */
void UART4_SendData8(uint8_t Data)
{
  /* Transmit Data */
  UART4->DR = Data;
}

/**
  * @brief  Transmits 9 bit data through the UART4 peripheral.
  * @param  Data: the data to transmit.
  * @retval None
  */
void UART4_SendData9(uint16_t Data)
{
  /* Clear the transmit data bit 8 */
  UART4->CR1 &= ((uint8_t)~UART4_CR1_T8);                  
  
  /* Write the transmit data bit [8] */
  UART4->CR1 |= (uint8_t)(((uint8_t)(Data >> 2)) & UART4_CR1_T8); 
  
  /* Write the transmit data bit [0:7] */
  UART4->DR   = (uint8_t)(Data);                    
}

/**
  * @brief  Transmits break characters.
  * @param  None
  * @retval None
  */
void UART4_SendBreak(void)
{
  UART4->CR2 |= UART4_CR2_SBK;
}

/**
  * @brief  Sets the address of the UART4 node.
  * @param  UART4_Address: Indicates the address of the UART4 node.
  * @retval None
  */
void UART4_SetAddress(uint8_t UART4_Address)
{
  /*assert_param for x UART4_Address*/
  assert_param(IS_UART4_ADDRESS_OK(UART4_Address));
  
  /* Clear the UART4 address */
  UART4->CR4 &= ((uint8_t)~UART4_CR4_ADD);
  /* Set the UART4 address node */
  UART4->CR4 |= UART4_Address;
}

/**
  * @brief  Sets the specified UART4 guard time.
  * @note   SmartCard Mode should be Enabled  
  * @param  UART4_GuardTime: specifies the guard time.
  * @retval None
  */
void UART4_SetGuardTime(uint8_t UART4_GuardTime)
{
  /* Set the UART4 guard time */
  UART4->GTR = UART4_GuardTime;
}

/**
  * @brief  Sets the system clock prescaler.
  * @note   IrDA Low Power mode or smartcard mode should be enabled
  * @note   This function is related to SmartCard and IrDa mode.
  * @param  UART4_Prescaler: specifies the prescaler clock.
  *         This parameter can be one of the following values:
  *         @par IrDA Low Power Mode
  *         The clock source is divided by the value given in the register (8 bits)
  *         - 0000 0000 Reserved
  *         - 0000 0001 divides the clock source by 1
  *         - 0000 0010 divides the clock source by 2
  *         - ...
  *        @par Smart Card Mode
  *        The clock source is divided by the value given in the register
  *        (5 significant bits) multiplied by 2
  *         - 0 0000 Reserved
  *         - 0 0001 divides the clock source by 2
  *         - 0 0010 divides the clock source by 4
  *         - 0 0011 divides the clock source by 6
  *         - ...
  * @retval None
  */
void UART4_SetPrescaler(uint8_t UART4_Prescaler)
{
  /* Load the UART4 prescaler value*/
  UART4->PSCR = UART4_Prescaler;
}

/**
  * @brief  Checks whether the specified UART4 flag is set or not.
  * @param  UART4_FLAG specifies the flag to check.
  *         This parameter can be any of the @ref UART4_Flag_TypeDef enumeration.
  * @retval FlagStatus (SET or RESET)
  */
FlagStatus UART4_GetFlagStatus(UART4_Flag_TypeDef UART4_FLAG)
{
  FlagStatus status = RESET;
  
  /* Check parameters */
  assert_param(IS_UART4_FLAG_OK(UART4_FLAG));
  
  /* Check the status of the specified UART4 flag*/
  if(UART4_FLAG == UART4_FLAG_LBDF)
  {
    if((UART4->CR4 & (uint8_t)UART4_FLAG) != (uint8_t)0x00)
    {
      /* UART4_FLAG is set*/
      status = SET;
    }
    else
    {
      /* UART4_FLAG is reset*/
      status = RESET;
    }
  }
  else if(UART4_FLAG == UART4_FLAG_SBK)
  {
    if((UART4->CR2 & (uint8_t)UART4_FLAG) != (uint8_t)0x00)
    {
      /* UART4_FLAG is set*/
      status = SET;
    }
    else
    {
      /* UART4_FLAG is reset*/
      status = RESET;
    }
  }
  else if((UART4_FLAG == UART4_FLAG_LHDF) || (UART4_FLAG == UART4_FLAG_LSF))
  {
    if((UART4->CR6 & (uint8_t)UART4_FLAG) != (uint8_t)0x00)
    {
      /* UART4_FLAG is set*/
      status = SET;
    }
    else
    {
      /* UART4_FLAG is reset*/
      status = RESET;
    }
  }
  else
  {
    if((UART4->SR & (uint8_t)UART4_FLAG) != (uint8_t)0x00)
    {
      /* UART4_FLAG is set*/
      status = SET;
    }
    else
    {
      /* UART4_FLAG is reset*/
      status = RESET;
    }
  }
  
  /* Return the UART4_FLAG status*/
  return  status;
}

/**
  * @brief  Clears the UART4 flags.
  * @param  UART4_FLAG specifies the flag to clear
  *         This parameter can be any combination of the following values:
  *         - UART4_FLAG_LBDF: LIN Break detection flag.
  *         - UART4_FLAG_LHDF: LIN Header detection flag.
  *         - UART4_FLAG_LSF: LIN synchrone field flag.
  *         - UART4_FLAG_RXNE: Receive data register not empty flag.
  * @note:
  *         - PE (Parity error), FE (Framing error), NE (Noise error), 
  *           OR (OverRun error) and IDLE (Idle line detected) flags are cleared
  *           by software sequence: a read operation to UART4_SR register 
  *           (UART4_GetFlagStatus())followed by a read operation to UART4_DR 
  *           register(UART4_ReceiveData8() or UART4_ReceiveData9()).
  *        
  *         - RXNE flag can be also cleared by a read to the UART4_DR register
  *           (UART4_ReceiveData8()or UART4_ReceiveData9()).
  *
  *         - TC flag can be also cleared by software sequence: a read operation
  *           to UART4_SR register (UART4_GetFlagStatus()) followed by a write 
  *           operation to UART4_DR register (UART4_SendData8() or UART4_SendData9()).
  *             
  *         - TXE flag is cleared only by a write to the UART4_DR register 
  *           (UART4_SendData8() or UART4_SendData9()).
  *             
  *         - SBK flag is cleared during the stop bit of break.
  * @retval None
  */
void UART4_ClearFlag(UART4_Flag_TypeDef UART4_FLAG)
{
  assert_param(IS_UART4_CLEAR_FLAG_OK(UART4_FLAG));
  
