xhawk18/s_task/build_stm8s103/STM8S_StdPeriph_Lib/Libraries/STM8S_StdPeriph_Driver/src/stm8s_uart4.c
  /*  Clear the Receive Register Not Empty flag */
  if(UART4_FLAG == UART4_FLAG_RXNE)
  {
    UART4->SR = (uint8_t)~(UART4_SR_RXNE);
  }
  /*  Clear the LIN Break Detection flag */
  else if(UART4_FLAG == UART4_FLAG_LBDF)
  {
    UART4->CR4 &= (uint8_t)(~UART4_CR4_LBDF);
  }
  /*  Clear the LIN Header Detection Flag */
  else if(UART4_FLAG == UART4_FLAG_LHDF)
  {
    UART4->CR6 &= (uint8_t)(~UART4_CR6_LHDF);
  }
  /*  Clear the LIN Synch Field flag */
  else
  {
    UART4->CR6 &= (uint8_t)(~UART4_CR6_LSF);
  }
}

/**
  * @brief  Checks whether the specified UART4 interrupt has occurred or not.
  * @param  UART4_IT: Specifies the UART4 interrupt pending bit to check.
  *         This parameter can be one of the following values:
  *         - UART4_IT_LBDF:  LIN Break detection interrupt
  *         - UART4_IT_TXE:  Transmit Data Register empty interrupt
  *         - UART4_IT_TC:   Transmission complete interrupt
  *         - UART4_IT_RXNE: Receive Data register not empty interrupt
  *         - UART4_IT_IDLE: Idle line detection interrupt
  *         - UART4_IT_OR:  OverRun Error interrupt
  *         - UART4_IT_PE:   Parity Error interrupt
  * @retval The state of UART4_IT (SET or RESET).
  */
ITStatus UART4_GetITStatus(UART4_IT_TypeDef UART4_IT)
{
  ITStatus pendingbitstatus = RESET;
  uint8_t itpos = 0;
  uint8_t itmask1 = 0;
  uint8_t itmask2 = 0;
  uint8_t enablestatus = 0;
  
  /* Check parameters */
  assert_param(IS_UART4_GET_IT_OK(UART4_IT));
  
  /* Get the UART4 IT index*/
  itpos = (uint8_t)((uint8_t)1 << (uint8_t)((uint8_t)UART4_IT & (uint8_t)0x0F));
  /* Get the UART4 IT index*/
  itmask1 = (uint8_t)((uint8_t)UART4_IT >> (uint8_t)4);
  /* Set the IT mask*/
  itmask2 = (uint8_t)((uint8_t)1 << itmask1);
  
  /* Check the status of the specified UART4 pending bit*/
  if(UART4_IT == UART4_IT_PE)
  {
    /* Get the UART4_ITPENDINGBIT enable bit status*/
    enablestatus = (uint8_t)((uint8_t)UART4->CR1 & itmask2);
    /* Check the status of the specified UART4 interrupt*/
    
    if(((UART4->SR & itpos) != (uint8_t)0x00) && enablestatus)
    {
      /* Interrupt occurred*/
      pendingbitstatus = SET;
    }
    else
    {
      /* Interrupt not occurred*/
      pendingbitstatus = RESET;
    }
  }
  else if(UART4_IT == UART4_IT_LBDF)
  {
    /* Get the UART4_IT enable bit status*/
    enablestatus = (uint8_t)((uint8_t)UART4->CR4 & itmask2);
    /* Check the status of the specified UART4 interrupt*/
    if(((UART4->CR4 & itpos) != (uint8_t)0x00) && enablestatus)
    {
      /* Interrupt occurred*/
      pendingbitstatus = SET;
    }
    else
    {
      /* Interrupt not occurred*/
      pendingbitstatus = RESET;
    }
  }
  else if(UART4_IT == UART4_IT_LHDF)
  {
    /* Get the UART4_IT enable bit status*/
    enablestatus = (uint8_t)((uint8_t)UART4->CR6 & itmask2);
    /* Check the status of the specified UART4 interrupt*/
    if(((UART4->CR6 & itpos) != (uint8_t)0x00) && enablestatus)
    {
      /* Interrupt occurred*/
      pendingbitstatus = SET;
    }
    else
    {
      /* Interrupt not occurred*/
      pendingbitstatus = RESET;
    }
  }
  else
  {
    /* Get the UART4_IT enable bit status*/
    enablestatus = (uint8_t)((uint8_t)UART4->CR2 & itmask2);
    /* Check the status of the specified UART4 interrupt*/
    if(((UART4->SR & itpos) != (uint8_t)0x00) && enablestatus)
    {
      /* Interrupt occurred*/
      pendingbitstatus = SET;
    }
    else
    {
      /* Interrupt not occurred*/
      pendingbitstatus = RESET;
    }
  }
  /* Return the UART4_IT status*/
  return  pendingbitstatus;
}

/**
  * @brief  Clears the UART4 pending flags.
  * @param  UART4_IT specifies the pending bit to clear
  *         This parameter can be one of the following values:
  *         - UART4_IT_LBDF:  LIN Break detection interrupt
  *         - UART4_IT_LHDF:  LIN Header detection interrupt
  *         - UART4_IT_RXNE: Receive Data register not empty interrupt.
  * @note
  *         - PE (Parity error), FE (Framing error), NE (Noise error), 
  *           OR (OverRun error) and IDLE (Idle line detected) pending bits are 
  *           cleared by software sequence: a read operation to UART4_SR register
  *           (UART4_GetITStatus()) followed by a read operation to UART4_DR register
  *           (UART4_ReceiveData8() or UART4_ReceiveData9()).
  *             
  *         - RXNE pending bit can be also cleared by a read to the UART4_DR 
  *           register (UART4_ReceiveData8() or UART4_ReceiveData9()).
  *              
  *         - TC (Transmit complete) pending bit can be cleared by software 
  *           sequence: a read operation to UART4_SR register 
  *           (UART4_GetITStatus()) followed by a write operation to UART4_DR 
  *           register (UART4_SendData8()or UART4_SendData9()).
  *               
  *         - TXE pending bit is cleared only by a write to the UART4_DR register
  *           (UART4_SendData8() or UART4_SendData9()).
  * @retval None
  */
void UART4_ClearITPendingBit(UART4_IT_TypeDef UART4_IT)
{
  assert_param(IS_UART4_CLEAR_IT_OK(UART4_IT));
  
  /*  Clear the Receive Register Not Empty pending bit */
  if(UART4_IT == UART4_IT_RXNE)
  {
    UART4->SR = (uint8_t)~(UART4_SR_RXNE);
  }
  /*  Clear the LIN Break Detection pending bit */
  else if(UART4_IT == UART4_IT_LBDF)
  {
    UART4->CR4 &= (uint8_t)~(UART4_CR4_LBDF);
  }
  /*  Clear the LIN Header Detection pending bit */
  else
  {
    UART4->CR6 &= (uint8_t)(~UART4_CR6_LHDF);
  }
}

/**
  * @}
  */

/**
  * @}
  */


/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
